const mongoose = require("mongoose");
const Fest = require("./functionalities/models").Fest; // Import the Event model

const link =
    "mongodb+srv://SWPRANTA04:EqsU4PgVzCx2CrRX@neurone-onuraunon.4oqzaaj.mongodb.net/?retryWrites=true&w=majority";

mongoose
    .connect(link, { useNewUrlParser: true, useUnifiedTopology: true })
    .then(() => {
        console.log("Connected to the database");

        // const eventData = [
        //     {
        //         eventTitle: "গণিত উৎসব - ২০২৩",
        //         location: "কোটচাঁদপুর মডেল সরকারি মাধ্যমিক বিদ্যালয়, কোটচাঁদপুর, ঝিনাইদহ, খুলনা",
        //         startTime: new Date("2023-01-21T10:00:00Z"),
        //         endTime: new Date("2023-01-24T12:00:00Z"),
        //         description: "বাঘে খাবে দূরে থাক, সে বনে বাঘ-ভালুক কিছু নেই। সেটা না গেয়ে সে তিলেকও থাকতে পারত না, তার দম আটকে আসত। তখন থেকে সে দাঁড়িয়ে দাঁড়িয়ে সেই ঢোলক লাঠি দিয়ে বাজায়। আমাদের গ্রামে এমন একটা ওস্তাদ হয়েছে, তার বাজনাটা বন্ধ হয়ে যাবে!’ শেষে ঠিক হল যে গ্রামের সকলে চাঁদা ক’রে বাঘাকে একটা ঢোলক কিনে দেবে, আর সেই ঢোলকটি আর তার ছাউনি খুব মজবুত হবে, যাতে বাঘার হাতেও আর সেটা সহজে না ছেঁড়ে। যখন সে মাঠে গিয়ে গান গাইত, তখন মাঠের যত গরু সব দড়ি ছিঁড়ে ভাগত। তখন সে করল কী, সারাদিন মাঠে মাঠে ঘুরে বেড়ায়, ক্ষুধার সময় তার নিজের গ্রামে গিয়ে ঢোলক বাজাতে থাকে, আর গ্রামের লোক তাড়াতাড়ি তাকে কিছু খাবার দিয়ে বিদায় করে বলে, ‘বাঁচলাম! শেষে যখন ‘হাঃ, হাঃ, হা- হা! ব’লে বাঘের মত খেঁকিয়ে উঠত, তখন সকলে পালাবার ফাঁক না পেয়ে চিৎপাত হয়ে প’ড়ে যেত। পাঁচুর ছেলেটির বড্ড ঢোলক বাজাবার শখ ছিল। ওটা এলেই তো ঢোলকসুদ্ধ আমাকে গিলে খাবে! ততদিনে তার বাজনা শুনে শুনে তার বাপ মা পাগল হয়ে গেল, গ্রামের লোকের মাথা ঘুরতে লাগল। তখন সে করল কী, সারাদিন মাঠে মাঠে ঘুরে বেড়ায়, ক্ষুধার সময় তার নিজের গ্রামে গিয়ে ঢোলক বাজাতে থাকে, আর গ্রামের লোক তাড়াতাড়ি তাকে কিছু খাবার দিয়ে বিদায় করে বলে, ‘বাঁচলাম!’ বাঘে খাবে দূরে থাক, সে বনে বাঘ - ভালুক কিছু নেই। আছে খালি একটা ভয়ানক জানোয়ার; আর দিনকতক এইভাবে চললে কি হত বলা যায় না। সেখানে রাখালের দল লাঠি নিয়ে আসতে বনের ভিতর গিয়ে খুব ক’রে গলা ভাঁজতে লাগল। তোমরা গান গাইতে পার ? আমি একজন লোকের কথা বলব, সে একটা গান গাইতে পারত। তখন একদিন কানু কাইন তাকে এই বড় বাঁশ নিয়ে তাড়া করতে সে ছুটে মাঠে চ’লে গেল; ওটা এলেই তো ঢোলকসুদ্ধ আমাকে গিলে খাবে!’ শেষে একটু ভাবল, ‘এ বনে থাকলে কখন প্রাণটা যাবে, তার চেয়ে এই বেলা এখান থেকে পালাই।’ সেখানে রাখালের দল লাঠি নিয়ে আসতে বনের ভিতর গিয়ে খুব ক’রে গলা ভাঁজতে লাগল। সে ভয়ানক জানোয়ার কিন্তু কেউ নয়, সে গুপি গাইন। শেষে আর তার ভয়ে তার বাবার দোকানে খদ্দেরই আসে না, রাখালেরাও মাঠে গরু নিয়ে যেতে পারে না। তার গ্রামের লোকেরা তা দেখে হাঁ ক’রে থাকত আর বলত, ‘আহা! আ -া-া!!অ - অ - অ - হ্ - হ্ - হ্!!!’ সেখানে দুদিন না থাকতে থাকতেই সেখানকার সকলে মিলে তাকে গ্রাম থেকে বার করে দিল। আছে খালি একটা ভয়ানক জানোয়ার; শেষে যখন ‘হাঃ, হাঃ, হা - হা! ব’লে বাঘের মত খেঁকিয়ে উঠত, তখন সকলে পালাবার ফাঁক না পেয়ে চিৎপাত হয়ে প’ড়ে যেত। গ্রামের লোকেরা পাঁচুকে বলল, ‘তুমি না পার, নাহয় আমরাই সকলে চাঁদা ক’রে ঢোলকের পয়সাটা দি। শেষে যখন ‘হাঃ, হাঃ, হা - হা!’ ব’লে বাঘের মত খেঁকিয়ে উঠত, তখন সকলে পালাবার ফাঁক না পেয়ে চিৎপাত হয়ে প’ড়ে যেত। বেরিয়েই দেখে আর একটা লোকও বিশাল ঢোল মাথায় করে সেই বনের ভিতর থেকে আসছে। তখন কাজেই তাকে অন্য একটা গ্রামে চলে যেতে হল। গুপি কিনা একটা গান গাইতে পারত, আর সে গ্রামের আর কেউ কিছু গাইতে পারত না, তাই তারা তাকে খাতির করে বলত গুপি ‘গাইন’।",
        //         imageUrl: ["/image/events/banner.jpg", "/image/events/banner2.jpg", "/image/events/1.jpg", "/image/events/2.jpg", "/image/events/3.jpg", "/image/events/4.jpg", "/image/events/5.jpg", "/image/events/6.jpg", "/image/events/7.jpg"],
        //     },
        //     {
        //         eventTitle: "গণিত উৎসব - ২০২৪",
        //         location: "কোটচাঁদপুর মডেল সরকারি মাধ্যমিক বিদ্যালয়, কোটচাঁদপুর, ঝিনাইদহ, খুলনা",
        //         startTime: new Date("2024-01-15T14:00:00Z"),
        //         endTime: new Date("2024-01-18T16:00:00Z"),
        //         description: "তার একটা মুদীর দোকান ছিল। দেড় মাস দিনরাত বাজিয়েও বাঘা সেটাকে ছিঁড়তে পারল না। তখন কাজেই তাকে অন্য একটা গ্রামে চলে যেতে হল। সে ভয়ানক জানোয়ার কিন্তু কেউ নয়, সে গুপি গাইন। গুপি কিনা একটা গান গাইতে পারত, আর সে গ্রামের আর কেউ কিছু গাইতে পারত না, তাই তারা তাকে খাতির করে বলত গুপি ‘গাইন’। তার গ্রামের লোকেরা তা দেখে হাঁ ক’রে থাকত আর বলত, ‘আহা! আ-া-া!!অ - অ - অ - হ্ - হ্ - হ্!!!’ আর তার ঢোলকের আওয়াজ শুনলেই আশপাশের সকল গ্রামের লোক লাঠি নিয়ে আসে। সেখানে দুদিন না থাকতে থাকতেই সেখানকার সকলে মিলে তাকে গ্রাম থেকে বার করে দিল। তারপর এমন হল যে আর কেউ তাকে খেতে দেয় না। দেড় মাস দিনরাত বাজিয়েও বাঘা সেটাকে ছিঁড়তে পারল না। আর দিনকতক এইভাবে চললে কি হত বলা যায় না। সেখানে দুদিন না থাকতে থাকতেই সেখানকার সকলে মিলে তাকে গ্রাম থেকে বার করে দিল। এই ভেবে গুপি চুপিচপি বন থেকে বেরিয়ে পড়ল। তখন সে করল কী, সারাদিন মাঠে মাঠে ঘুরে বেড়ায়, ক্ষুধার সময় তার নিজের গ্রামে গিয়ে ঢোলক বাজাতে থাকে, আর গ্রামের লোক তাড়াতাড়ি তাকে কিছু খাবার দিয়ে বিদায় করে বলে, ‘বাঁচলাম!’ সেখানে দুদিন না থাকতে থাকতেই সেখানকার সকলে মিলে তাকে গ্রাম থেকে বার করে দিল। তারপর থেকে সে যেখানেই যায়, সেখান থেকেই তাকে তাড়িয়ে দেয়। এর মধ্যে একদিন গ্রামের সকলে মিলে মোটা মোটা লাঠি নিয়ে এসে বাঘাকে বললে, ‘লক্ষ্মী, দাদা! তোমাকে দশ হাঁড়ি মিঠাই দিচ্ছি, অন্য কোথাও চ’লে যাও, নইলে আমরা সবাই পাগল হয়ে যাব!’ তার একটা মুদীর দোকান ছিল। শেষে আর পাঁচু তার ঢোলকের পয়সা দিয়ে উঠতে পারে না। গুপিও বাঘার বাজনা শুনতে পায়, আর বাঘারই মতো ভয়ে কাঁপে। শেষে যখন ‘হাঃ, হাঃ, হা - হা!’ ব’লে বাঘের মত খেঁকিয়ে উঠত, তখন সকলে পালাবার ফাঁক না পেয়ে চিৎপাত হয়ে প’ড়ে যেত। শেষে আর পাঁচু তার ঢোলকের পয়সা দিয়ে উঠতে পারে না। যখন সে মাঠে গিয়ে গান গাইত, তখন মাঠের যত গরু সব দড়ি ছিঁড়ে ভাগত। তখন একদিন কানু কাইন তাকে এই বড় বাঁশ নিয়ে তাড়া করতে সে ছুটে মাঠে চ’লে গেল; না হয় বাঘে খাবে, তবুও আমার বাজনা চলবে।’ সে যা ঢোলক হল! তার মুখ হল সাড়ে - তিন হাত চওড়া, আর ছাউনি মোষের চামড়ার। বাঘা সেটা পেয়ে যার পর নাই খুশি হয়ে বললে, ‘আমি দাঁড়িয়ে বাজাব।’",
        //         imageUrl: ["/image/events/banner.jpg"],
        //     },
        // ];

        const eventData = [
            {
                festTitle: "৪র্থ গণিত উৎসব",
                location: "কোটচাঁদপুর মডেল সরকারি মাধ্যমিক বিদ্যালয়, কোটচাঁদপুর, ঝিনাইদহ, খুলনা",
                startTime: new Date("2024-01-28T09:00:00Z"),
                description: "আর্জেন্টিনা দীর্ঘ ৩৬ বছর পর বিশ্বকাপ শিরোপা জিতলেও, বছর না ঘুরতেই আবারও শুরু হয়েছে নিউরনে অনুরণন এর ৩য় গণিত উৎসব, \"গণিত উৎসব ২০২৩\" এর কার্যক্রম! \"নিউরনে অনুরণন - গণিত উৎসব ২০২৩\" এর রেজিস্ট্রেশন কার্যক্রম শুরু হবে ১ জানুয়ারি, ২০২৩ থেকে। কোটচাঁদপুর উপজেলার মাধ্যমিক পর্যায়ের সকল প্রতিষ্ঠানের শিক্ষার্থীরা রেজিস্ট্রেশন কার্যক্রম এর অন্তর্ভুক্ত থাকবে। উপজেলার বাইরে থেকে অংশগ্রহণকারী শিক্ষাপ্রতিষ্ঠানের নাম খুব শীঘ্রই নিউরনে অনুরণন এর পক্ষ থেকে জানানো হবে। তবে আর দেরী কেন? আজই শুরু করে দাও \"নিউরনে অনুরণন - গণিত উৎসব ২০২৩\" এর প্রস্তুতি! সবার সেকেন্ড ডিফারেন্সিয়াল নেগেটিভ হোক!",
                imageUrl: "/image/events/banner.jpg",
            }
        ]

        async function insertEventData() {
            try {
                for (const eventDataItem of eventData) {
                    const event = new Fest(eventDataItem);
                    await event.save();
                }
                console.log("Data inserted successfully.");
            } catch (error) {
                console.error("Error inserting data:", error);
            } finally {
                // Close the MongoDB connection
                mongoose.connection.close();
                console.log("Database connection closed.");
            }
        }

        insertEventData();
    })
    .catch((err) => {
        console.log("Error connecting to the database: ", err);
    });
